programmingTutorial07V2406/bak/testCase/caseThermoFoamCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    frontAndBack
    {
        type            fixedValue;
        value           uniform 1e5;
      }

    topAndBottom
    {
      type            fixedValue;
      value           uniform  1e5;
    }

    hot
    {
      type            zeroGradient;
    }

    cold
    {
      type            zeroGradient;
    }

}




// ************************************************************************* //
